# running in ~/hermes_workspace/projects/IP-010/v4/04_frontend_stage/rtl-watchdog/formal/watchdog_bmc/src/
read -formal ef_util_lib.v
read -formal EF_WDT32.v
read -formal EF_WDT32_WB_wrapper.v
read -formal watchdog.v
hierarchy -top EF_WDT32_WB_wrapper
proc; opt
flatten; opt

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
