# running in ~/hermes_workspace/projects/IP-010/v4/04_frontend_stage/rtl-gpio/formal/gpio_bmc/src/
read -formal EF_GPIO8.v
read -formal EF_GPIO8_WB_wrapper.v
read -formal ef_util_lib.v
read -formal gpio.v
hierarchy -top EF_GPIO8_WB_wrapper
proc; opt
flatten; opt

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
