# running in ~/hermes_workspace/projects/IP-010/v4/04_frontend_stage/rtl-dshot_pwm/formal/dshot_pwm_bmc/src/
read -formal dshot_pwm.v
hierarchy -top dshot_pwm
proc; opt
flatten; opt

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
