# running in ~/hermes_workspace/projects/IP-010/v4/04_frontend_stage/rtl-timer/formal/timer_bmc/src/
read -formal EF_TMR32.v
read -formal EF_TMR32_WB_wrapper.v
read -formal ef_util_lib.v
read -formal timer.v
hierarchy -top EF_TMR32_WB_wrapper
proc; opt
flatten; opt

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
